/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: wind_queue.c
**创   建   人: 周江村
**最后修改日期: 2012.09.26
**描        述: wind os的消息相关的代码
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 周江村
** 版  本: v1.0
** 日　期: 2012.09.26
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 周江村
** 日　期: 2012.10.20
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#include "wind_type.h"
#include "wind_comman.h"
//把字符串转换成带符号整数
w_int32_t wind_convert_str2s32_t(w_int8_t *str)
{
    w_bool_t flag = B_FALSE;
    w_uint8_t i = 0;
    w_int32_t num = 0;
    if(str[0] == '-')
    {
        flag = B_TRUE;
        i = 1;
    }
    while(1)
    {
        if(str[i] <= '9' && str[i] >= '0')
        {
            num = num * 10 + str[i] - '0';
            i ++;
        }
        else
            break;
    }
    if(flag)
        num = - num;
    return num;
}

//把字符串转换成无符号整数
w_uint32_t wind_convert_str2u32_t(w_int8_t *str)
{
    w_uint32_t num = 0;
    w_uint8_t i = 0;
    while(1)
    {
        if(str[i] <= '9' && str[i] >= '0')
        {
            num = num * 10 + str[i] - '0';
            i ++;
        }
        else
            break;
    }
    return num;
}

