/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
** 文   件   名: wind_atomic.h / wind_atomic.c
** 创   建   人: Jason Zhou
** 最后修改日期: 2014/10/26 2:20:23
** 描        述: 基本原子操作函数方法
**  
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: Jason Zhou
** 版  本: v1.0
** 日　期: 2014/10/26 2:20:23
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
** 本文件由C语言源文件模板软件生成。------------清风海岸出品，必属精品！------------
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef WIND_ATOMIC_H__
#define WIND_ATOMIC_H__

/*********************************************header file***********************************************/
#include "wind_config.h"
#include "wind_type.h"
#ifdef __cplusplus
extern "C" {
#endif // #ifdef __cplusplus



/***********************************************macros*************************************************/



/***********************************************enum*************************************************/



/***********************************************struct*************************************************/
typedef struct __atomic_t
{
    volatile w_uint32_t value;
}w_atomic_t;

/********************************************global variable declare**********************************************/



/********************************************global function declare**********************************************/
void atomic_inc(w_atomic_t atom);
void atomic_dec(w_atomic_t atom);

void atomic_add(w_atomic_t atom,w_uint32_t va);
void atomic_minus(w_atomic_t atom,w_uint32_t va);

void atomic_set(w_atomic_t atom,w_uint32_t value);
void atomic_get(w_atomic_t atom,w_uint32_t *value);



#ifdef __cplusplus
}
#endif // #ifdef __cplusplus
#endif // #ifndef WIND_ATOMIC_H__

