/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: wind_fsops.h
**创   建   人: Jason Zhou
**最后修改日期: 
**描        述: 文件系统标准化操作集API接口
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 
** 版  本: v1.0
** 日　期: 
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef WIND_FILE_H__
#define WIND_FILE_H__
#include "wind_config.h"
#include "wind_blkdev.h"
#include "wind_filepath.h"
#include "fs_def.h"

#if WIND_MODULE_VFS_SUPPORT

w_fsops_s *wind_fsops_get(const char *name);
char *wind_vfs_checktype(w_blkdev_s *blkdev,char *type);
w_err_t wind_fsops_register(w_fsops_s *ops);
w_err_t wind_fsops_unregister(w_fsops_s *ops);
w_err_t wind_fsops_init(void);
#endif
#endif

