/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**文   件   名: tb_demo.c
**创   建   人: Jason Zhou
**最后修改日期: 2017/11/23
**描        述: 
**  
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: Jason Zhou
** 版  本: v1.0
** 日　期: 2017/11/23
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#include "db_if.h"
#include "db_demo.h"
#include "db_entry.h"
//定义数据库结构

TABLE_START(tb_demo)
TABLE_ITEM_A(tb_demo,w_int32_t,key,DB_ATTR_KEY_ITEM)
TABLE_ITEM(tb_demo,w_int32_t,ademo)
TABLE_ITEM(tb_demo,w_int8_t,bdemo)
TABLE_ITEM(tb_demo,w_int16_t,cdemo)
TABLE_END
TABLE_DEF(tb_demo,DB_ATTR_SINGLE)



