/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
** 文   件   名: tank_module.c
** 创   建   人: Jason Zhou
** 最后修改日期: 2015/1/24 20:24:37
** 描        述: 坦克大战游戏
**  
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: Jason Zhou
** 版  本: v1.0
** 日　期: 2015/1/24 20:24:37
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
** 本文件由C语言源文件模板软件生成。------------清风海岸出品，必属精品！------------
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#include "wind_std.h"
#include "wind_cmd.h"
#include "wind_module.h"
#ifdef __cplusplus
extern "C" {
#endif // #ifdef __cplusplus


/*********************************************头文件定义***********************************************/

#if (WIND_MODULE_GAME_SUPPORT)

/********************************************内部变量定义**********************************************/




/********************************************内部函数定义*********************************************/



/********************************************全局变量定义**********************************************/



/********************************************全局函数定义**********************************************/
COMMAND_DISC(tank)
{
    wind_printf("[WIN32] to play tanks war game.\r\n");
}

COMMAND_USAGE(tank)
{
    wind_printf("tank:--to start tanks war game.\r\n");
}
extern int tank_main(int argc,char **argv);
COMMAND_MAIN(tank,argc,argv)
{
    tank_main(argc,argv);
    _wind_std_init();
    return W_ERR_OK;
}

COMMAND_DEF(tank);


MODULE_INIT(tank)
{
    return wind_cmd_register(COMMAND(tank), 1);
}

MODULE_EXIT(tank)
{
    return wind_cmd_unregister(COMMAND(tank));
}

MODULE_DEF(tank, 0x0100,"shell");



#endif
#ifdef __cplusplus
}
#endif // #ifdef __cplusplus
