/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
** 文   件   名: cmd_echo.h / cmd_echo.c
** 创   建   人: 周江村
** 最后修改日期: 2015/1/24 20:24:37
** 描        述: 
**  
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 周江村
** 版  本: v1.0
** 日　期: 2015/1/24 20:24:37
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 回声输处命令定义函数
** 本文件由C语言源文件模板软件生成。------------清风海岸出品，必属精品！------------
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif // #ifdef __cplusplus


/*********************************************头文件定义***********************************************/
#include "console_framework.h"



/********************************************内部变量定义**********************************************/




/********************************************内部函数定义*********************************************/



/********************************************全局变量定义**********************************************/



/********************************************全局函数定义**********************************************/
static w_err_t cmd_echo_main(w_int32_t argc,char **argv)
{
    char *str;
    if(argc < 1)
        return ERR_COMMAN;
    str = argv[0];
    wind_printf("%s",str);
    return ERR_OK;
}

cmd_s g_cmd_echo[] = 
{
    {
        NULL, "echo", "to display echo string that you input.",
        "echo <str>:to show str on your std displaying device.",
        cmd_echo_main
    },
};

void register_cmd_echo(console_s *ctrl)
{
    wind_cmd_register(&ctrl->cmd_list,g_cmd_echo,sizeof(g_cmd_echo)/sizeof(cmd_s));
}

#ifdef __cplusplus
}
#endif // #ifdef __cplusplus
