/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: list_dev.c
**创   建   人: Jason Zhou
**最后修改日期: 2018.03.26
**描        述: 字符设备注册文件
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: Jason Zhou
** 版  本: v1.0
** 日　期: 2018.03.26  
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: Jason Zhou
** 日　期: 2018.03.26
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#include "wind_chdev.h"
#include "wind_debug.h"
#if WIND_CHDEV_SUPPORT

//extern w_chdev_s gpio_dev[1];
//extern w_chdev_s led_dev[3];
//extern w_chdev_s beep_dev[1];

w_err_t _wind_register_chdevs(void)
{
    //wind_chdev_register(gpio_dev,1);
    //wind_chdev_register(led_dev,3);
    //wind_chdev_register(beep_dev,1);
    return W_ERR_OK;
}

#endif

