/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: wind_core_inc.h
**创   建   人: 周江村
**最后修改日期: 2012.09.26
**描        述: wind os的包含文件集合
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 周江村
** 版  本: v1.0
** 日　期: 2012.09.26
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 周江村
** 日　期: 2012.10.20
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef WIND_CORE_INC_H__
#define WIND_CORE_INC_H__


#include "wind_config.h"
#include "wind_type.h"
#include "wind_debug.h"
#include "wind_core.h"
#include "wind_os_hwif.h"
#include "wind_time.h"

#include "wind_queue.h"
#include "wind_mutex.h"
#include "wind_msgbox.h"
#include "wind_thread.h"
#include "wind_sem.h"

#include "wind_pipe.h"

#include "wind_string.h"

#ifdef __cplusplus
extern "C" {
#endif


#ifdef __cplusplus
}
#endif

#endif

