/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: wind_flag.h
**创   建   人: 周江村
**最后修改日期: 2012.09.26
**描        述: wind os的标志对象支持
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 周江村
** 版  本: v1.0
** 日　期: 2012.09.26
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 周江村
** 日　期: 2012.10.20
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef WIND_flag_H__
#define WIND_flag_H__

#include "wind_config.h"
#include "wind_types.h"

#ifdef __cplusplus
extern "C" {
#endif
typedef struct _wind_flag
{

    s8_t flag;
    u8_t isvalid;
}flag_s,*pflag_s;



err_t wind_flag_new(pflag_s pflag,u8_t cnt);
err_t wind_flag_signal(pflag_s pflag);
err_t wind_flag_fetch(pflag_s pflag,u32_t timeout);
err_t wind_flag_free(pflag_s pflag);






#ifdef __cplusplus
}
#endif

#endif
