/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: wind_conv.h
**创   建   人: Jason Zhou
**最后修改日期: 2017.12.10
**描        述: 
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 
** 版  本: v1.0
** 日　期: 2017.12.10
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 2017.12.10
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef WIND_CONV_H__
#define WIND_CONV_H__
#include "wind_type.h"

w_bool_t wind_atoi(char *str,w_int32_t *value);
void wind_itoa(char *str,w_int32_t value);

w_bool_t wind_atoui(char *str,w_uint32_t *value);
void wind_uitoa(char *str,w_uint32_t value);

w_bool_t wind_htoi(char *hex,w_uint32_t *value);
void wind_itoh(char *hex,w_uint32_t value);
#endif

